Revit 2027 API
ParameterTypeId.ColumnBaseAttachedParam Property
 "Base is Attached"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ColumnBaseAttachedParam { get; }
Public Shared ReadOnly Property ColumnBaseAttachedParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ColumnBaseAttachedParam {
	ForgeTypeId^ get ();
}
static member ColumnBaseAttachedParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace